SAALE-Performance-Test/Speech/jmeter.log
2018-04-09 15:29:15,444 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2018-04-09 15:29:15,469 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/4.0/libexec/bin/user.properties
2018-04-09 15:29:15,470 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/4.0/libexec/bin/system.properties
2018-04-09 15:29:15,470 INFO o.a.j.JMeter: Setting JMeter property: baseUrl=preprod-saale.saal.ai
2018-04-09 15:29:15,470 INFO o.a.j.JMeter: Setting JMeter property: threads=2
2018-04-09 15:29:15,470 INFO o.a.j.JMeter: Setting JMeter property: time=1
2018-04-09 15:29:15,470 INFO o.a.j.JMeter: Setting JMeter property: count=1
2018-04-09 15:29:15,470 INFO o.a.j.JMeter: Setting JMeter property: Speech=Speech2_keyterm_Faq_elastic.csv
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: Version 4.0 r1823414
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: java.version=1.8.0_161
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: os.name=Mac OS X
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: os.arch=x86_64
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: os.version=10.13.1
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: file.encoding=UTF-8
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: Max memory     =1073741824
2018-04-09 15:29:15,474 INFO o.a.j.JMeter: Available Processors =8
2018-04-09 15:29:15,478 INFO o.a.j.JMeter: Default Locale=English (EN)
2018-04-09 15:29:15,478 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2018-04-09 15:29:15,478 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/4.0/libexec
2018-04-09 15:29:15,478 INFO o.a.j.JMeter: user.dir  =/Users/ssolanki/Documents/PerformanceTest/Speech
2018-04-09 15:29:15,478 INFO o.a.j.JMeter: PWD       =/Users/ssolanki/Documents/PerformanceTest/Speech
2018-04-09 15:29:15,490 INFO o.a.j.JMeter: IP: 192.168.101.185 Name: Adfgs-MacBook-Pro-7.local FullName: 192.168.101.185
2018-04-09 15:29:15,494 INFO o.a.j.s.FileServer: Default base='/Users/ssolanki/Documents/PerformanceTest/Speech'
2018-04-09 15:29:15,498 INFO o.a.j.s.FileServer: Set new base='/Users/ssolanki/Documents/PerformanceTest/Speech'
2018-04-09 15:29:15,601 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2018-04-09 15:29:15,624 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2018-04-09 15:29:15,628 INFO o.a.j.s.SaveService: Using SaveService properties version 4.0
2018-04-09 15:29:15,632 INFO o.a.j.s.SaveService: Loading file: /Users/ssolanki/Documents/PerformanceTest/Speech/SpeechLoadTest.jmx
2018-04-09 15:29:15,710 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-04-09 15:29:15,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-04-09 15:29:15,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-04-09 15:29:15,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-04-09 15:29:15,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2018-04-09 15:29:15,711 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2018-04-09 15:29:15,734 INFO o.a.j.JMeter: Creating summariser <summary>
2018-04-09 15:29:15,738 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2018-04-09 15:29:15,738 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-04-09 15:29:15,738 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-04-09 15:29:15,742 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2018-04-09 15:29:15,742 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2018-04-09 15:29:16,285 INFO o.a.j.JMeter: Running test (1523273356285)
2018-04-09 15:29:16,316 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : SpeechEndPoint
2018-04-09 15:29:16,317 INFO o.a.j.e.StandardJMeterEngine: Starting 2 threads for group SpeechEndPoint.
2018-04-09 15:29:16,317 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2018-04-09 15:29:16,317 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=2 ramp-up=1 perThread=500.0 delayedStart=false
2018-04-09 15:29:16,333 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2018-04-09 15:29:16,333 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2018-04-09 15:29:16,334 INFO o.a.j.t.JMeterThread: Thread started: SpeechEndPoint 1-1
2018-04-09 15:29:16,335 INFO o.a.j.s.FileServer: Stored: TestData/Speech2_keyterm_Faq_elastic.csv
2018-04-09 15:29:16,349 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Adfgs-MacBook-Pro-7.local
2018-04-09 15:29:16,354 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2018-04-09 15:29:16,360 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2018-04-09 15:29:16,361 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2018-04-09 15:29:16,361 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2018-04-09 15:29:16,361 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2018-04-09 15:29:16,645 INFO o.a.j.p.h.s.LazySchemeSocketFactory: Setting up HTTPS TrustAll Socket Factory
2018-04-09 15:29:16,652 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2018-04-09 15:29:16,652 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2018-04-09 15:29:16,835 INFO o.a.j.t.JMeterThread: Thread started: SpeechEndPoint 1-2
2018-04-09 15:29:16,843 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2018-04-09 15:29:16,844 INFO o.a.j.u.SSLManager: KeyStore created OK
2018-04-09 15:29:16,844 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2018-04-09 15:29:23,786 INFO o.a.j.t.JMeterThread: Thread is done: SpeechEndPoint 1-1
2018-04-09 15:29:23,787 INFO o.a.j.t.JMeterThread: Thread finished: SpeechEndPoint 1-1
2018-04-09 15:29:24,639 INFO o.a.j.t.JMeterThread: Thread is done: SpeechEndPoint 1-2
2018-04-09 15:29:24,639 INFO o.a.j.t.JMeterThread: Thread finished: SpeechEndPoint 1-2
2018-04-09 15:29:24,640 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2018-04-09 15:29:24,640 INFO o.a.j.s.FileServer: Close: TestData/Speech2_keyterm_Faq_elastic.csv
2018-04-09 15:29:24,641 INFO o.a.j.r.Summariser: summary =      2 in 00:00:08 =    0.2/s Avg:  7588 Min:  7382 Max:  7794 Err:     0 (0.00%)